### Terraform Plan Output for `identity-team-account/s3`
```hcl
[command]/home/runner/work/_temp/1b68db47-cec3-4c86-aa6d-0a53282421e0/terraform-bin show -no-color tfplan.binary

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.resource_locks["cloudwatch"] will be created
  + resource "aws_dynamodb_table" "resource_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "cloudwatch-identity-lock"
      + read_capacity    = (known after apply)
      + region           = "ap-northeast-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "identity"
          + "Name"        = "cloudwatch Lock Table"
        }
      + tags_all         = {
          + "Environment" = "identity"
          + "Name"        = "cloudwatch Lock Table"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.resource_locks["firehose"] will be created
  + resource "aws_dynamodb_table" "resource_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "firehose-identity-lock"
      + read_capacity    = (known after apply)
      + region           = "ap-northeast-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "identity"
          + "Name"        = "firehose Lock Table"
        }
      + tags_all         = {
          + "Environment" = "identity"
          + "Name"        = "firehose Lock Table"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.resource_locks["opensearch"] will be created
  + resource "aws_dynamodb_table" "resource_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "opensearch-identity-lock"
      + read_capacity    = (known after apply)
      + region           = "ap-northeast-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "identity"
          + "Name"        = "opensearch Lock Table"
        }
      + tags_all         = {
          + "Environment" = "identity"
          + "Name"        = "opensearch Lock Table"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.resource_locks["securitylake"] will be created
  + resource "aws_dynamodb_table" "resource_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "securitylake-identity-lock"
      + read_capacity    = (known after apply)
      + region           = "ap-northeast-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "identity"
          + "Name"        = "securitylake Lock Table"
        }
      + tags_all         = {
          + "Environment" = "identity"
          + "Name"        = "securitylake Lock Table"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_kms_key.s3_key will be created
  + resource "aws_kms_key" "s3_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for S3 encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + region                             = "ap-northeast-2"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # aws_s3_bucket.state_org will be created
  + resource "aws_s3_bucket" "state_org" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cloudfence-identity-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "identity"
          + "Name"        = "Terraform State Bucket"
        }
      + tags_all                    = {
          + "Environment" = "identity"
          + "Name"        = "Terraform State Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_ownership_controls.ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "ownership" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-northeast-2"

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # aws_s3_bucket_public_access_block.state_org_block will be created
  + resource "aws_s3_bucket_public_access_block" "state_org_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-northeast-2"
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-northeast-2"

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.state_org_versioning will be created
  + resource "aws_s3_bucket_versioning" "state_org_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-northeast-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_dynamodb_table.resource_locks["cloudwatch"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "cloudwatch-identity-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "identity"%0A          + "Name"        = "cloudwatch Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "identity"%0A          + "Name"        = "cloudwatch Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["firehose"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "firehose-identity-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "identity"%0A          + "Name"        = "firehose Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "identity"%0A          + "Name"        = "firehose Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["opensearch"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "opensearch-identity-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "identity"%0A          + "Name"        = "opensearch Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "identity"%0A          + "Name"        = "opensearch Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["securitylake"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "securitylake-identity-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "identity"%0A          + "Name"        = "securitylake Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "identity"%0A          + "Name"        = "securitylake Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_kms_key.s3_key will be created%0A  + resource "aws_kms_key" "s3_key" {%0A      + arn                                = (known after apply)%0A      + bypass_policy_lockout_safety_check = false%0A      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"%0A      + description                        = "KMS key for S3 encryption"%0A      + enable_key_rotation                = true%0A      + id                                 = (known after apply)%0A      + is_enabled                         = true%0A      + key_id                             = (known after apply)%0A      + key_usage                          = "ENCRYPT_DECRYPT"%0A      + multi_region                       = (known after apply)%0A      + policy                             = (known after apply)%0A      + region                             = "ap-northeast-2"%0A      + rotation_period_in_days            = (known after apply)%0A      + tags_all                           = (known after apply)%0A    }%0A%0A  # aws_s3_bucket.state_org will be created%0A  + resource "aws_s3_bucket" "state_org" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "cloudfence-identity-bucket"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_region               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = "ap-northeast-2"%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "identity"%0A          + "Name"        = "Terraform State Bucket"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "identity"%0A          + "Name"        = "Terraform State Bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # aws_s3_bucket_ownership_controls.ownership will be created%0A  + resource "aws_s3_bucket_ownership_controls" "ownership" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "ap-northeast-2"%0A%0A      + rule {%0A          + object_ownership = "ObjectWriter"%0A        }%0A    }%0A%0A  # aws_s3_bucket_public_access_block.state_org_block will be created%0A  + resource "aws_s3_bucket_public_access_block" "state_org_block" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + region                  = "ap-northeast-2"%0A      + restrict_public_buckets = true%0A    }%0A%0A  # aws_s3_bucket_server_side_encryption_configuration.encryption will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "encryption" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "ap-northeast-2"%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + kms_master_key_id = (known after apply)%0A              + sse_algorithm     = "aws:kms"%0A            }%0A        }%0A    }%0A%0A  # aws_s3_bucket_versioning.state_org_versioning will be created%0A  + resource "aws_s3_bucket_versioning" "state_org_versioning" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "ap-northeast-2"%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0APlan: 10 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_dynamodb_table.resource_locks["cloudwatch"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "cloudwatch-identity-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "identity"%0A          + "Name"        = "cloudwatch Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "identity"%0A          + "Name"        = "cloudwatch Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["firehose"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "firehose-identity-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "identity"%0A          + "Name"        = "firehose Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "identity"%0A          + "Name"        = "firehose Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["opensearch"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "opensearch-identity-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "identity"%0A          + "Name"        = "opensearch Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "identity"%0A          + "Name"        = "opensearch Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_dynamodb_table.resource_locks["securitylake"] will be created%0A  + resource "aws_dynamodb_table" "resource_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "securitylake-identity-lock"%0A      + read_capacity    = (known after apply)%0A      + region           = "ap-northeast-2"%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "identity"%0A          + "Name"        = "securitylake Lock Table"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "identity"%0A          + "Name"        = "securitylake Lock Table"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + server_side_encryption {%0A          + enabled     = true%0A          + kms_key_arn = (known after apply)%0A        }%0A    }%0A%0A  # aws_kms_key.s3_key will be created%0A  + resource "aws_kms_key" "s3_key" {%0A      + arn                                = (known after apply)%0A      + bypass_policy_lockout_safety_check = false%0A      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"%0A      + description                        = "KMS key for S3 encryption"%0A      + enable_key_rotation                = true%0A      + id                                 = (known after apply)%0A      + is_enabled                         = true%0A      + key_id                             = (known after apply)%0A      + key_usage                          = "ENCRYPT_DECRYPT"%0A      + multi_region                       = (known after apply)%0A      + policy                             = (known after apply)%0A      + region                             = "ap-northeast-2"%0A      + rotation_period_in_days            = (known after apply)%0A      + tags_all                           = (known after apply)%0A    }%0A%0A  # aws_s3_bucket.state_org will be created%0A  + resource "aws_s3_bucket" "state_org" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "cloudfence-identity-bucket"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_region               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = "ap-northeast-2"%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "identity"%0A          + "Name"        = "Terraform State Bucket"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "identity"%0A          + "Name"        = "Terraform State Bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # aws_s3_bucket_ownership_controls.ownership will be created%0A  + resource "aws_s3_bucket_ownership_controls" "ownership" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "ap-northeast-2"%0A%0A      + rule {%0A          + object_ownership = "ObjectWriter"%0A        }%0A    }%0A%0A  # aws_s3_bucket_public_access_block.state_org_block will be created%0A  + resource "aws_s3_bucket_public_access_block" "state_org_block" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + region                  = "ap-northeast-2"%0A      + restrict_public_buckets = true%0A    }%0A%0A  # aws_s3_bucket_server_side_encryption_configuration.encryption will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "encryption" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "ap-northeast-2"%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + kms_master_key_id = (known after apply)%0A              + sse_algorithm     = "aws:kms"%0A            }%0A        }%0A    }%0A%0A  # aws_s3_bucket_versioning.state_org_versioning will be created%0A  + resource "aws_s3_bucket_versioning" "state_org_versioning" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "ap-northeast-2"%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0APlan: 10 to add, 0 to change, 0 to destroy.%0A

::set-output name=stderr::

::set-output name=exitcode::0
```